In [2]:
import pandas as pd
import numpy as np

In [8]:
list = [1,2,3,4,5]
df1 = pd.DataFrame(list)
print(df1)
print(type(df1))

   0
0  1
1  2
2  3
3  4
4  5
<class 'pandas.core.frame.DataFrame'>

In [10]:
df1['1col'] = list
print(df1)

   0  1col
0  1     1
1  2     2
2  3     3
3  4     4
4  5     5

In [15]:
print(df1.columns)

Index([0, '1col'], dtype='object')

In [16]:
df2 = df1.rename(columns={0 : "0col"})
print(df2)

   0col  1col
0     1     1
1     2     2
2     3     3
3     4     4
4     5     5

In [18]:
score = [
    ['jeongyackyoung',70,80,100],
    ['leesunsin',60,50,90],
    ['leeyoulgock',50,100,60]
]
print(type(score))
print(score)

<class 'list'>
[['jeongyackyoung', 70, 80, 100], ['leesunsin', 60, 50, 90], ['leeyoulgock', 50, 100, 60]]

In [20]:
df3 = pd.DataFrame(score)
print(df3)
print(type(df3))

                0   1    2    3
0  jeongyackyoung  70   80  100
1       leesunsin  60   50   90
2     leeyoulgock  50  100   60
<class 'pandas.core.frame.DataFrame'>

In [23]:
df3.columns = ["name", "korean", "english", "math"]
print(df3)
print(df3.shape)
print(df3.index)

             name  korean  english  math
0  jeongyackyoung      70       80   100
1       leesunsin      60       50    90
2     leeyoulgock      50      100    60
(3, 4)
RangeIndex(start=0, stop=3, step=1)

In [25]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     3 non-null      object
 1   korean   3 non-null      int64
 2   english  3 non-null      int64
 3   math     3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 228.0+ bytes

In [27]:
df3.describe()

       korean     english        math
count     3.0    3.000000    3.000000
mean     60.0   76.666667   83.333333
std      10.0   25.166115   20.816660
min      50.0   50.000000   60.000000
25%      55.0   65.000000   75.000000
50%      60.0   80.000000   90.000000
75%      65.0   90.000000   95.000000
max      70.0  100.000000  100.000000

In [ ]:
dic1 = {
  'col1' : ["1","2","3",'4'],
  'col2' : [5,6,7,8]
}

n = pd.DataFrame(dic1)
print(n)

  col1  col2
0    1     5
1    2     6
2    3     7
3    4     8

           col2
count  4.000000
mean   6.500000
std    1.290994
min    5.000000
25%    5.750000
50%    6.500000
75%    7.250000
max    8.000000

In [42]:
n.info()
n.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      object
 1   col2    4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 196.0+ bytes

           col2
count  4.000000
mean   6.500000
std    1.290994
min    5.000000
25%    5.750000
50%    6.500000
75%    7.250000
max    8.000000

In [44]:
n_df = n.astype({'col1': int, 'col2':float})
print(n_df.dtypes)
n_df.describe()

col1      int64
col2    float64
dtype: object

           col1      col2
count  4.000000  4.000000
mean   2.500000  6.500000
std    1.290994  1.290994
min    1.000000  5.000000
25%    1.750000  5.750000
50%    2.500000  6.500000
75%    3.250000  7.250000
max    4.000000  8.000000